In [1]:
import psycopg2

In [2]:
conn = psycopg2.connect("dbname=udacity user=postgres password=pswrd")

cur = conn.cursor()

conn.set_session(autocommit=True)

### Create an unnormalized table named music lib:

![alt text](pic2.png "Image 1 Display")

## CREATE TABLE music_lib

In [7]:
cur.execute("CREATE TABLE music_lib (album_ID int, album_name varchar, artist_name varchar, year int, songs text[])")

In [8]:
cur.execute("INSERT INTO music_lib (album_ID, album_name, artist_name, year, songs) values (%s, %s, %s, %s, %s)",
           (1, "Rubber Soul", "The Beatles", 1965, ["Michelle", "Think For Yourself", "In My Life"]))


cur.execute("INSERT INTO music_lib (album_ID, album_name, artist_name, year, songs) values (%s, %s, %s, %s, %s)",
           (2, "Let It Be", "The Beatles", 1970, ["Let It Be", "Across The Universe"]))

In [9]:
cur.execute("SELECT * FROM music_lib")
row = cur.fetchone()

while row:
    print(row)
    row = cur.fetchone()

(1, 'Rubber Soul', 'The Beatles', 1965, ['Michelle', 'Think For Yourself', 'In My Life'])
(2, 'Let It Be', 'The Beatles', 1970, ['Let It Be', 'Across The Universe'])

### 1NF:

![alt text](pic3.png "Image 1 Display")

## CREATE TABLE song_lib: 1NF

In [10]:
cur.execute("CREATE TABLE song_lib (song_ID int, album_name varchar, artist_name varchar, year int, song_name varchar)")

In [11]:
cur.execute("INSERT INTO song_lib (song_ID, album_name, artist_name, year, song_name) values(%s, %s, %s, %s, %s)",
           (1, "Rubber Soul", "The Beatles", 1965, "Michelle"))

cur.execute("INSERT INTO song_lib (song_ID, album_name, artist_name, year, song_name) values(%s, %s, %s, %s, %s)",
           (1, "Rubber Soul", "The Beatles", 1965, "Think For Yourself"))

cur.execute("INSERT INTO song_lib (song_ID, album_name, artist_name, year, song_name) values(%s, %s, %s, %s, %s)",
           (1, "Rubber Soul", "The Beatles", 1965, "In My Life"))

cur.execute("INSERT INTO song_lib (song_ID, album_name, artist_name, year, song_name) values(%s, %s, %s, %s, %s)",
           (2, "Let It Be", "The Beatles", 1970, "Let It Be"))

cur.execute("INSERT INTO song_lib (song_ID, album_name, artist_name, year, song_name) values(%s, %s, %s, %s, %s)",
           (2, "Let It Be", "The Beatles", 1970, "Across The Universe"))

In [13]:
cur.execute("SELECT * FROM song_lib")

row = cur.fetchone()

while row:
    print(row)
    row = cur.fetchone()

(1, 'Rubber Soul', 'The Beatles', 1965, 'Michelle')
(1, 'Rubber Soul', 'The Beatles', 1965, 'Think For Yourself')
(1, 'Rubber Soul', 'The Beatles', 1965, 'In My Life')
(2, 'Let It Be', 'The Beatles', 1970, 'Let It Be')
(2, 'Let It Be', 'The Beatles', 1970, 'Across The Universe')

### 2NF:

![alt text](pic4.png "Image 1 Display")

## CREATE TABLES album_lib2 & song_lib2

In [18]:
cur.execute("CREATE TABLE album_lib2 (album_ID int, album_name varchar, artist_name varchar, year int)")

cur.execute("CREATE TABLE song_lib2 (song_ID int, album_ID int, song_name varchar)")

In [19]:
cur.execute("INSERT INTO album_lib2 (album_ID, album_name, artist_name, year) values(%s, %s, %s, %s)",
           (1, "Rubber Soul", "The Beatles", 1965))

cur.execute("INSERT INTO album_lib2 (album_ID, album_name, artist_name, year) values(%s, %s, %s, %s)",
           (2, "Let It Be", "The Beatles", 1970))

In [20]:
cur.execute("INSERT INTO song_lib2 (song_ID, album_ID, song_name) values(%s, %s, %s)",
           (1, 1, "Michelle"))

cur.execute("INSERT INTO song_lib2 (song_ID, album_ID, song_name) values(%s, %s, %s)",
           (2, 1, "Think For Yourself"))

cur.execute("INSERT INTO song_lib2 (song_ID, album_ID, song_name) values(%s, %s, %s)",
           (3, 1, "In My Life"))

cur.execute("INSERT INTO song_lib2 (song_ID, album_ID, song_name) values(%s, %s, %s)",
           (4, 2, "Let It Be"))

cur.execute("INSERT INTO song_lib2 (song_ID, album_ID, song_name) values(%s, %s, %s)",
           (5, 2, "Across The Universe"))

In [21]:
cur.execute("SELECT * FROM album_lib2")

row = cur.fetchone()

while row:
    print(row)
    row = cur.fetchone()

(1, 'Rubber Soul', 'The Beatles', 1965)
(2, 'Let It Be', 'The Beatles', 1970)

In [22]:
cur.execute("SELECT * FROM song_lib2")

row = cur.fetchone()

while row:
    print(row)
    row = cur.fetchone()

(1, 1, 'Michelle')
(2, 1, 'Think For Yourself')
(3, 1, 'In My Life')
(4, 2, 'Let It Be')
(5, 2, 'Across The Universe')

## Join tables albim_lib2 & song_lib2

In [23]:
cur.execute("SELECT * FROM album_lib2 JOIN song_lib2 on album_lib2.album_ID = song_lib2.album_ID")

row = cur.fetchone()

while row:
    print(row)
    row = cur.fetchone()

(1, 'Rubber Soul', 'The Beatles', 1965, 1, 1, 'Michelle')
(1, 'Rubber Soul', 'The Beatles', 1965, 2, 1, 'Think For Yourself')
(1, 'Rubber Soul', 'The Beatles', 1965, 3, 1, 'In My Life')
(2, 'Let It Be', 'The Beatles', 1970, 4, 2, 'Let It Be')
(2, 'Let It Be', 'The Beatles', 1970, 5, 2, 'Across The Universe')

### 3NF:

![alt text](pic9.png "Image 1 Display")

In [21]:
# First Table - Album library 
cur.execute("create table if not exists album_lib2(album_id int, album_name varchar, artist_id int, year int)")


cur.execute("insert into album_lib2 (album_id, album_name, artist_id, year) values(%s, %s, %s, %s)",
            (1, "Rubber Soul", 1, 1965))

cur.execute("insert into album_lib2 (album_id, album_name, artist_id, year) values(%s, %s, %s, %s)",
            (2, "Let It Be", 1, 1970))



# Second table -- Artist Library  
cur.execute("create table if not exists artist_lib (artist_id int, artist_name varchar)")

cur.execute("insert into artist_lib (artist_id, artist_name) values(%s, %s)", (1, "The Beatles"))

In [22]:
print("Table: Albulm \n")
      
cur.execute("SELECT * FROM album_lib2")
            
row = cur.fetchone()
while row:
    print(row)
    row = cur.fetchone()      
            

        
        
        
print("\n \n table: Song Library \n")

cur.execute("SELECT * FROM song_lib")
            
row = cur.fetchone()
while row:
    print(row)
    row = cur.fetchone()
            
            
            
            
            
print("\n \n table: Artist Library")
            
cur.execute("SELECT * FROM artist_lib")
            
row = cur.fetchone()
while row:
    print(row)
    row = cur.fetchone()

Table: Albulm

(1, 'Rubber Soul', 1, 1965)
(2, 'Let It Be', 1, 1970)


 table: Song Library

(1, 1, 'Michelle')
(2, 1, 'Think For Yourself')
(3, 1, 'In My Life')
(4, 2, 'Let It Be')
(5, 2, 'Across The Universe')


 table: Artist Library
(1, 'The Beatles')

## Do 2 Joins on 3 Tables - so that we can get all the info we had in our first table

In [24]:
cur.execute("select * from (artist_lib join album_lib2 on artist_lib.artist_id = album_lib2.artist_id) join song_lib on album_lib2.album_id=song_lib.album_id")



row = cur.fetchone()
while row:
    print(row)
    row = cur.fetchone()

(1, 'The Beatles', 1, 'Rubber Soul', 1, 1965, 1, 1, 'Michelle')
(1, 'The Beatles', 1, 'Rubber Soul', 1, 1965, 2, 1, 'Think For Yourself')
(1, 'The Beatles', 1, 'Rubber Soul', 1, 1965, 3, 1, 'In My Life')
(1, 'The Beatles', 2, 'Let It Be', 1, 1970, 4, 2, 'Let It Be')
(1, 'The Beatles', 2, 'Let It Be', 1, 1970, 5, 2, 'Across The Universe')

### Done! We have Normalized our dataset

In [24]:
#cur.execute("DROP TABLE music_lib")

#cur.execute("DROP TABLE music_lib2")

#cur.execute("DROP TABLE album_lib")

#cur.execute("DROP TABLE song_lib")